Revit 2026 API

# ToposolidSimplify Method

---

Simplifies the Toposolid by reducing the number of inner vertices to the given percentage.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Simplify(
	double percentage
)
```
```vb
Public Sub Simplify (
	percentage As Double
)
```
```cpp
public:
void Simplify(
	double percentage
)
```
```fsharp
member Simplify :
        percentage : float -> unit
```

#### Parameters

percentage Double
     The ratio of the number of inner vertices after simplify to the original number.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input percentage should be greater than 0 and less than 1. |
| InvalidOperationException | this operation failed. |

At low percentages, the inner vertices may not be reduced to the exact percentage to keep a rough semblance of the original shape. Call this method again if you want to keep removing inner vertices.

#### Reference

Toposolid Class

Autodesk.Revit.DB Namespace